Project/Toir/src/Documents/гкс_ЕВОБланк/гкс_ЕВОБланк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЕВОБланк</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.гкс_ОжидаемыеМероприятияЕвобланк</registerRecords>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорневойПричины</name>
    <type>
      <types>CatalogRef.гкс_ТипыКорневыхПричин</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВызоваТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНеисправности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПринятые</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричинаТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазборТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕвоБланкПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОстанова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальникСмены</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаграммаСобытий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроблем</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>EnumRef.гкс_ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПовторныйОтказ</name>
    <comment>TOIR20-534</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МероприятияПоПредупреждению</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>TOIR20-462</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АнализПричины</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорневаяПричина</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/гкс_ТекущиеФМОР/гкс_ТекущиеФМОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТекущиеФМОР</name>
  <resources>
    <name>ФМ</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ТМ</name>
    <type>
      <types>CatalogRef.гкс_ТехническиеМеста</types>
    </type>
  </resources>
  <resources>
    <name>ТМФМ</name>
    <type>
      <types>CatalogRef.гкс_ТехническиеМеста</types>
    </type>
  </resources>
  <dimensions>
    <name>ОР</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ИсторияСтатусовСогласованияДокументов/торо_ИсторияСтатусовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИсторияСтатусовСогласованияДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <type>
      <types>DefinedType.торо_СогласуемыеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаКого</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ТекущиеКадровыеДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеКадровыеДанныеСотрудников</name>
  <resources>
    <name>ТекущееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеРабочееМестоВОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекущийВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/гкс_ТипыПроблем/гкс_ТипыПроблем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроблем</name>
  <enumValues>
    <name>ПроблемаСКачеством</name>
  </enumValues>
  <enumValues>
    <name>БлокировкаПродуктом</name>
  </enumValues>
  <enumValues>
    <name>ПопаданиеПостороннегоПредмета</name>
  </enumValues>
  <enumValues>
    <name>Механика</name>
  </enumValues>
  <enumValues>
    <name>АСУТП</name>
  </enumValues>
  <enumValues>
    <name>КИПиА</name>
  </enumValues>
  <enumValues>
    <name>Электрика</name>
  </enumValues>
  <enumValues>
    <name>Метрология</name>
  </enumValues>
  <enumValues>
    <name>Внешняя</name>
  </enumValues>
  <enumValues>
    <name>НеОпределена</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/гкс_ЗоныОтветственности/гкс_ЗоныОтветственности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ЗоныОтветственности</name>
  <enumValues>
    <name>ОтделПланированияТОиР</name>
  </enumValues>
  <enumValues>
    <name>Механики</name>
  </enumValues>
  <enumValues>
    <name>АСУТП</name>
  </enumValues>
  <enumValues>
    <name>ИСЗиС</name>
  </enumValues>
  <enumValues>
    <name>КИПиА</name>
  </enumValues>
  <enumValues>
    <name>Метрология</name>
  </enumValues>
  <enumValues>
    <name>ПСиГХ</name>
  </enumValues>
  <enumValues>
    <name>ВОиК</name>
  </enumValues>
  <enumValues>
    <name>ВКиАО</name>
  </enumValues>
  <enumValues>
    <name>Электрики</name>
  </enumValues>
  <enumValues>
    <name>РМУ_ЦКОО</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Технология</name>
  </enumValues>
  <enumValues>
    <name>СЗМОиУ</name>
  </enumValues>
  <enumValues>
    <name>СервиснаяКомпания</name>
  </enumValues>
  <enumValues>
    <name>Внешняя</name>
  </enumValues>
  <enumValues>
    <name>НеОпределена</name>
  </enumValues>
  <enumValues>
    <name>ОтделПоНадежностиОборудования</name>
    <comment>TOIR20-805</comment>
  </enumValues>
  <enumValues>
    <name>СлужбаИТОтделАдминистрирования</name>
    <comment>TOIR20-805</comment>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_ИдентификаторыТехКарт/торо_ИдентификаторыТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ИдентификаторыТехКарт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Владелец</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Обслуживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/гкс_ТехническиеМеста/гкс_ТехническиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ТехническиеМеста</name>
  <attributes>
    <name>МестоПлощадка</name>
    <type>
      <types>CatalogRef.гкс_МестаИПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводПодразделение</name>
    <type>
      <types>CatalogRef.гкс_ЗаводыИПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.гкс_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Эстакада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Здание</name>
    <type>
      <types>CatalogRef.гкс_Здания</types>
    </type>
  </attributes>
  <attributes>
    <name>Этаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отметка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Documents/гкс_ЕВОБланк/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьАктуальнуюСтруктуру(Дефект = Неопределено, Бланк = Неопределено)Экспорт

	Запрос = Новый Запрос;
	Если Бланк = Неопределено Тогда 
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID,
			|	торо_ВыявленныеДефектыСписокДефектов.гкс_СимптомДефекта КАК гкс_СимптомДефекта,
			|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
			|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
			|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидНеисправности,
			|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.гкс_Влияние КАК Влияние,
			|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
			|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения КАК ДатаОбнаружения
			|ПОМЕСТИТЬ НужныеДефекты
			|ИЗ
			|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
			|ГДЕ
			|	торо_ВыявленныеДефектыСписокДефектов.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Дефект);
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ВыявленныеДефектыСписокДефектов.ID КАК ID,
			|	торо_ВыявленныеДефектыСписокДефектов.гкс_СимптомДефекта КАК гкс_СимптомДефекта,
			|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
			|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОбъектРемонта,
			|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидНеисправности,
			|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.гкс_Влияние КАК Влияние,
			|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
			|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения КАК ДатаОбнаружения
			|ПОМЕСТИТЬ НужныеДефекты
			|ИЗ
			|	Документ.гкс_ЕВОБланк КАК гкс_ЕВОБланк
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
			|		ПО гкс_ЕВОБланк.ДокументОснование = торо_ВыявленныеДефектыСписокДефектов.Ссылка
			|ГДЕ
			|	гкс_ЕВОБланк.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Бланк);
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + " ; " +
			"ВЫБРАТЬ
			|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID КАК ИД,
			|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ИД,
			|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
			|	НужныеДефекты.ID КАК ИДРемонта,
			|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка КАК Акт,
			|	ТИПЗНАЧЕНИЯ(торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ИдентификаторыТехКарт) КАК ЭтоТК
			|ПОМЕСТИТЬ ВсеРРИзАкта
			|ИЗ
			|	НужныеДефекты КАК НужныеДефекты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
			|		ПО НужныеДефекты.ID = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
			|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка.ПометкаУдаления = ЛОЖЬ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВсеРРИзАкта.ИДРемонта КАК ИДРемонта,
			|	ВсеРРИзАкта.ИД КАК ИД,
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	СУММА(торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Количество) КАК Количество,
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
			|	ВсеРРИзАкта.Акт КАК Акт,
			|	ВсеРРИзАкта.Родитель_ИД КАК Родитель_ИД
			|ПОМЕСТИТЬ ВсеМЗИзАкта
			|ИЗ
			|	ВсеРРИзАкта КАК ВсеРРИзАкта
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
			|		ПО ВсеРРИзАкта.Акт = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка
			|			И ВсеРРИзАкта.ИДРемонта = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID
			|			И ВсеРРИзАкта.ИД = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID
			|			И (НЕ торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсеРРИзАкта.ИДРемонта,
			|	ВсеРРИзАкта.ИД,
			|	ВсеРРИзАкта.Акт,
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения,
			|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура,
			|	ВсеРРИзАкта.Родитель_ИД
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	НужныеДефекты.ID КАК ID,
			|	НужныеДефекты.гкс_СимптомДефекта КАК СимптомДефекта,
			|	НужныеДефекты.ОбъектРемонта КАК ОбъектРемонта,
			|	НужныеДефекты.ОтказавшийЭлемент КАК ОтказавшийЭлемент,
			|	НужныеДефекты.ВидНеисправности КАК ВидНеисправности,
			|	НужныеДефекты.Влияние КАК Влияние,
			|	НужныеДефекты.ДефектОписание КАК ДефектОписание,
			|	НужныеДефекты.ДатаОбнаружения КАК ДатаОбнаружения
			|ИЗ
			|	НужныеДефекты КАК НужныеДефекты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	гкс_ТехническиеМеста.ЗаводПодразделение КАК Завод,
			|	гкс_ТехническиеМеста.Участок КАК Участок
			|ИЗ
			|	НужныеДефекты КАК НужныеДефекты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ЗаявкаРемонты
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
			|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
			|				ПО (гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
			|							И гкс_ТекущиеФМОР.ТМ = гкс_ТехническиеМеста.Ссылка
			|						ИЛИ НЕ гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
			|							И гкс_ТекущиеФМОР.ТМФМ = гкс_ТехническиеМеста.Ссылка)
			|			ПО ЗаявкаРемонты.ОбъектРемонта = гкс_ТекущиеФМОР.ОР
			|		ПО НужныеДефекты.ID = ЗаявкаРемонты.ID
			|			И (ЗаявкаРемонты.Ссылка.ПометкаУдаления = ЛОЖЬ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗаявкаРемонты.Ссылка.Проведен УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВсеРРИзАкта.РемонтнаяРабота КАК РР,
			|	ВсеРРИзАкта.ИДРемонта КАК ИДРемонта,
			|	ВсеМЗИзАкта.Номенклатура КАК Номенклатура,
			|	СУММА(ВсеМЗИзАкта.Количество) КАК Количество,
			|	ВсеМЗИзАкта.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ВсеРРИзАкта.Акт КАК Акт,
			|	ВсеРРИзАкта.ИД КАК ИД
			|ИЗ
			|	ВсеРРИзАкта КАК ВсеРРИзАкта
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеМЗИзАкта КАК ВсеМЗИзАкта
			|		ПО ВсеРРИзАкта.ИД = ВсеМЗИзАкта.Родитель_ИД
			|			И ВсеРРИзАкта.Акт = ВсеМЗИзАкта.Акт
			|ГДЕ
			|	ВсеРРИзАкта.ЭтоТК = ИСТИНА
			|
			|СГРУППИРОВАТЬ ПО
			|	ВсеРРИзАкта.РемонтнаяРабота,
			|	ВсеРРИзАкта.ИДРемонта,
			|	ВсеМЗИзАкта.Номенклатура,
			|	ВсеМЗИзАкта.ЕдиницаИзмерения,
			|	ВсеРРИзАкта.Акт,
			|	ВсеРРИзАкта.ИД
			|ИТОГИ
			|	МАКСИМУМ(РР)
			|ПО
			|	Акт,
			|	ИД
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МИНИМУМ(ЕстьNULL(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала, ДатаВремя(1,1,1))) КАК ДатаНачала,
			|	МАКСИМУМ(ЕстьNULL(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания, ДатаВремя(1,1,1))) КАК ДатаОкончания
			|ИЗ
			|	НужныеДефекты КАК НужныеДефекты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
			|		ПО НужныеДефекты.ID = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
			|			И (торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.ПометкаУдаления = ЛОЖЬ)";

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	КВозврату = новый Структура("Завод,Участок,ОписаниеПроблемы,ФункциональноеМесто,ОтказавшийЭлемент,ВидНеисправности,Влияние,ВремяНачалаРаботыТС,ВремяОкончанияРаботыТС");

	КВозврату.Вставить("ДатаОбнаружения", Дата(1,1,1));
	КВозврату.Вставить("ВидДефекта", Неопределено);
	
	Выборка = РезультатЗапроса[3].Выбрать();	
	Пока Выборка.Следующий() Цикл
		КВозврату.Вставить("ОписаниеПроблемы", Строка(Выборка.СимптомДефекта) + Символы.ПС + Выборка.ДефектОписание);
		КВозврату.Вставить("ФункциональноеМесто", Выборка.ОбъектРемонта);
		КВозврату.Вставить("ОтказавшийЭлемент", Выборка.ОтказавшийЭлемент);
		КВозврату.Вставить("ВидНеисправности", Выборка.ВидНеисправности);
		КВозврату.Вставить("Влияние", Выборка.Влияние);
		КВозврату.Вставить("ДатаОбнаружения", Выборка.ДатаОбнаружения);
		КВозврату.Вставить("ВидДефекта", Выборка.ВидНеисправности);
	КонецЦикла;
	
	Выборка = РезультатЗапроса[4].Выбрать();	
	Пока Выборка.Следующий() Цикл
		КВозврату.Завод = Выборка.Завод;
		КВозврату.Участок = Выборка.Участок;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[6].Выбрать();	
	Пока Выборка.Следующий() Цикл
		КВозврату.Вставить("ВремяНачалаРаботыТС",Выборка.ДатаНачала);
		КВозврату.Вставить("ВремяОкончанияРаботыТС",Выборка.ДатаОкончания);
	КонецЦикла;
	Если КВозврату.ВремяНачалаРаботыТС = null Тогда 
		КВозврату.ВремяНачалаРаботыТС = Дата(1,1,1);
	КонецЕсли;
	Если КВозврату.ВремяОкончанияРаботыТС = null Тогда 
		КВозврату.ВремяОкончанияРаботыТС = Дата(1,1,1);
	КонецЕсли;
	
	ТЧ1 = Новый ТаблицаЗначений();
	ТЧ1.Колонки.Добавить("НомерТК", Новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(5)));
	ТЧ1.Колонки.Добавить("ТехКарта", Новый ОписаниеТипов("СправочникСсылка.торо_ИдентификаторыТехКарт"));
	//
	ТЧ2 = Новый ТаблицаЗначений();
	ТЧ2.Колонки.Добавить("НомерТК", Новый ОписаниеТипов("Число",,,новый КвалификаторыЧисла(5)));
	ТЧ2.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЧ2.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры"));
	ТЧ2.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,, новый КвалификаторыЧисла(15, 3)));
	//
	НомерПП = 0;
	Выборка1 = РезультатЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока Выборка1.Следующий() Цикл
		Выборка2 = Выборка1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборка2.Следующий() Цикл
			НомерПП = НомерПП + 1;
			НС = ТЧ1.Добавить();
			НС.НомерТК = НомерПП;
			НС.ТехКарта = Выборка2.РР;
			Выборка = Выборка2.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда 
					НС = ТЧ2.Добавить();
					НС.НомерТК = НомерПП;
					ЗаполнитьЗначенияСвойств(НС, Выборка);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	КВозврату.Вставить("РемонтныеРаботы", ТЧ1);
	КВозврату.Вставить("МатЗатраты", ТЧ2);

	Возврат КВозврату;
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.гкс_ЕВОБланк";
	КомандаПечати.Идентификатор = "ЕВОБланк";
	КомандаПечати.Представление = НСтр("ru='EWO-бланк';en='EWO-form'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.гкс_ЕВОБланк";
	КомандаПечати.Идентификатор = "ЕВОБланк5Почему";
	КомандаПечати.Представление = НСтр("ru='5 почему';en='5 WHY'");
		
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЕВОБланк");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЕВОБланк",
		НСтр("ru='EWO-бланк';en='EWO-form'"),
		ПечатьБланк2023(МассивОбъектов, ПараметрыПечати),
		, 
		"Документ.гкс_ЕВОБланк.ПФ_MXL_ЕВОБланк");

	КонецЕсли;
	
	НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЕВОБланк5Почему");
	Если НужноПечататьМакет Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ЕВОБланк5Почему",
		НСтр("ru='5 почему';en='5 WHY'"),
		Печать5Почему(МассивОбъектов, ПараметрыПечати),
		, 
		"Документ.гкс_ЕВОБланк.ПФ_MXL_5Почему");

	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьБланк(МассивОбъектов, ПараметрыПечати) 
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.гкс_ЕВОБланк.ПФ_MXL_ЕВОБланк");
	ТабДок = Новый ТабличныйДокумент();
	
	Шапка1 = Макет.ПолучитьОбласть("Шапка1");
	СтрокаМЗ = Макет.ПолучитьОбласть("СтрокаМЗ");
	СтрокаМ = Макет.ПолучитьОбласть("СтрокаМ");
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	
	//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	НомерПоследнейСтроки = 1;
	//	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	гкс_ЕВОБланк.Ссылка КАК Ссылка,
		|	гкс_ЕВОБланк.Номер КАК Номер,
		|	гкс_ЕВОБланк.Ответственный КАК ОтветственныйЕВО,
		|	гкс_ЕВОБланк.КорневаяПричина КАК КорневаяПричина,
		|	гкс_ЕВОБланк.ВремяНачалаОстановки КАК ВремяНачалаОстановки,
		|	гкс_ЕВОБланк.ВремяВызоваТС КАК ВремяВызоваТС,
		|	гкс_ЕВОБланк.ВремяЗапуска КАК ВремяЗапуска,
		|	гкс_ЕВОБланк.ТипКорневойПричины КАК ТипКорневойПричины,
		|	торо_ВыявленныеДефектыСписокДефектов.гкс_СимптомДефекта КАК СимптомДефекта,
		|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОР,
		|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК Отказавший,
		|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.гкс_Влияние КАК Влияние,
		|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.КонтактноеЛицоИнициатора КАК КЛИ,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения КАК ДатаОбнаружения,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Ответственный КАК ОтветственныйВД,
		|	торо_ВыявленныеДефектыСписокДефектов.ID КАК ИД
		|ПОМЕСТИТЬ ВсеЕВО
		|ИЗ
		|	Документ.гкс_ЕВОБланк КАК гкс_ЕВОБланк
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		|		ПО гкс_ЕВОБланк.ДокументОснование = торо_ВыявленныеДефектыСписокДефектов.Ссылка
		|ГДЕ
		|	гкс_ЕВОБланк.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеЕВО.Ссылка КАК Ссылка,
		|	МИНИМУМ(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания) КАК ДатаОкончания,
		|	МАКСИМУМ(торо_ИсторияСтатусовСогласованияДокументов.Пользователь) КАК Проверяющий
		|ПОМЕСТИТЬ ИзАкта
		|ИЗ
		|	ВсеЕВО КАК ВсеЕВО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|		ПО ВсеЕВО.ИД = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
		|			И (торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов КАК торо_ИсторияСтатусовСогласованияДокументов
		|		ПО ВсеЕВО.Ссылка = торо_ИсторияСтатусовСогласованияДокументов.СогласуемыйДокумент
		|			И (торо_ИсторияСтатусовСогласованияДокументов.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеЕВО.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеЕВО.Ссылка КАК Ссылка,
		|	ВсеЕВО.Номер КАК Номер,
		|	ВсеЕВО.ОтветственныйЕВО КАК ОтветственныйЕВО,
		|	ВсеЕВО.КорневаяПричина КАК КорневаяПричина,
		|	ВсеЕВО.ВремяНачалаОстановки КАК ВремяНачалаОстановки,
		|	ВсеЕВО.ВремяВызоваТС КАК ВремяВызоваТС,
		|	ВсеЕВО.ВремяЗапуска КАК ВремяЗапуска,
		|	ВсеЕВО.ТипКорневойПричины КАК ТипКорневойПричины,
		|	ВсеЕВО.СимптомДефекта КАК СимптомДефекта,
		|	ВсеЕВО.ОР КАК ОР,
		|	ВсеЕВО.Отказавший КАК Отказавший,
		|	ВсеЕВО.ВидДефекта КАК ВидДефекта,
		|	ВсеЕВО.Влияние КАК Влияние,
		|	ВсеЕВО.ДефектОписание КАК ДефектОписание,
		|	ВсеЕВО.КЛИ КАК КЛИ,
		|	ВсеЕВО.ДатаОбнаружения КАК ДатаОбнаружения,
		|	ВсеЕВО.ОтветственныйВД КАК ОтветственныйВД,
		|	ВсеЕВО.ИД КАК ИД,
		|	ИзАкта.ДатаНачала КАК ДатаНачала,
		|	ИзАкта.ДатаОкончания КАК ДатаОкончания,
		|	ИзАкта.Проверяющий КАК Проверяющий,
		|	гкс_ТехническиеМеста.ЗаводПодразделение КАК Завод,
		|	гкс_ТехническиеМеста.Участок КАК Участок
		|ИЗ
		|	ВсеЕВО КАК ВсеЕВО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИзАкта КАК ИзАкта
		|		ПО ВсеЕВО.Ссылка = ИзАкта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК ДефектРемонты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ЗаявкаРемонты
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
		|					ПО (гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
		|								И гкс_ТекущиеФМОР.ТМ = гкс_ТехническиеМеста.Ссылка
		|							ИЛИ НЕ гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
		|								И гкс_ТекущиеФМОР.ТМФМ = гкс_ТехническиеМеста.Ссылка)
		|				ПО ЗаявкаРемонты.ОбъектРемонта = гкс_ТекущиеФМОР.ОР
		|			ПО ДефектРемонты.ID = ЗаявкаРемонты.ID
		|		ПО ВсеЕВО.Ссылка.ДокументОснование = ДефектРемонты.Ссылка
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Мероприятие КАК Мероприятие,
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Ответственный КАК Ответственный,
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Срок КАК Срок,
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.гкс_ЕВОБланк.МероприятияПоПредупреждению КАК гкс_ЕВОБланкМероприятияПоПредупреждению
		|ГДЕ
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гкс_ЕВОБланкАнализПричины.Причина КАК Причина,
		|	гкс_ЕВОБланкАнализПричины.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.гкс_ЕВОБланк.АнализПричины КАК гкс_ЕВОБланкАнализПричины
		|ГДЕ
		|	гкс_ЕВОБланкАнализПричины.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID КАК ИД,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ИД,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	НужныеДефекты.ИД КАК ИДРемонта,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка КАК Акт,
		|	ТИПЗНАЧЕНИЯ(торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ИдентификаторыТехКарт) КАК ЭтоТК,
		|	НужныеДефекты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВсеРРИзАкта
		|ИЗ
		|	ВсеЕВО КАК НужныеДефекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
		|		ПО НужныеДефекты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
		|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеРРИзАкта.ИДРемонта КАК ИДРемонта,
		|	ВсеРРИзАкта.ИД КАК ИД,
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
		|	ВсеРРИзАкта.Акт КАК Акт,
		|	ВсеРРИзАкта.Родитель_ИД КАК Родитель_ИД
		|ПОМЕСТИТЬ ВсеМЗИзАкта
		|ИЗ
		|	ВсеРРИзАкта КАК ВсеРРИзАкта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
		|		ПО ВсеРРИзАкта.Акт = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка
		|			И ВсеРРИзАкта.ИДРемонта = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID
		|			И ВсеРРИзАкта.ИД = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеРРИзАкта.ИДРемонта,
		|	ВсеРРИзАкта.ИД,
		|	ВсеРРИзАкта.Акт,
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения,
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура,
		|	ВсеРРИзАкта.Родитель_ИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеМЗИзАкта.Номенклатура КАК Номенклатура,
		|	ВсеРРИзАкта.Ссылка КАК Ссылка
		|ИЗ
		|	ВсеРРИзАкта КАК ВсеРРИзАкта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеМЗИзАкта КАК ВсеМЗИзАкта
		|		ПО ВсеРРИзАкта.ИД = ВсеМЗИзАкта.Родитель_ИД
		|			И ВсеРРИзАкта.Акт = ВсеМЗИзАкта.Акт
		|ГДЕ
		|	ВсеРРИзАкта.ЭтоТК = ИСТИНА
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеРРИзАкта.Ссылка КАК Ссылка,
		|	ВсеРРИзАкта.РемонтнаяРабота КАК РР
		|ИЗ
		|	ВсеРРИзАкта КАК ВсеРРИзАкта
		|ГДЕ
		|	ВсеРРИзАкта.ЭтоТК = ИСТИНА
		|ИТОГИ ПО
		|	Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	Выборка1 = РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаМ1 = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаА1 = РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаМЗ1 = РезультатЗапроса[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаРР1 = РезультатЗапроса[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	

	Пока Выборка1.Следующий() Цикл
		Шапка = Макет.ПолучитьОбласть("Шапка"); // Для очистки полей
		Подвал = Макет.ПолучитьОбласть("Подвал");
		Подвал1 = Макет.ПолучитьОбласть("Подвал1");
		//
		Если НомерПоследнейСтроки > 1 Тогда 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		Выборка = Выборка1.Выбрать();
		Если Выборка.Следующий() Тогда 
			Подвал.Параметры.ОтветственныйЕВО = Выборка.ОтветственныйЕВО;
			Подвал1.Параметры.КорневаяПричина = Выборка.КорневаяПричина;
			Шапка.Параметры.Номер = Выборка.Номер;
			Шапка.Параметры.ВремяВызоваТС = Выборка.ВремяВызоваТС + (СдвигЧП * 3600);
			Шапка.Параметры.ВремяНачалаОстановки = Выборка.ВремяНачалаОстановки + (СдвигЧП * 3600);
			Шапка.Параметры.ВремяЗапуска = Выборка.ВремяЗапуска + (СдвигЧП * 3600);
			Шапка.Параметры.ТипКорневойПричины = Выборка.ТипКорневойПричины;
			//
			Шапка.Параметры.ДатаОбнаружения = Выборка.ДатаОбнаружения + (СдвигЧП * 3600);
			Шапка.Параметры.КЛИ = Выборка.КЛИ;
			Шапка.Параметры.ОР = Выборка.ОР;
			Шапка.Параметры.Отказавший = Выборка.Отказавший;
			Шапка.Параметры.Ответственный = Выборка.ОтветственныйВД;
			Подвал.Параметры.Ответственный = Выборка.ОтветственныйВД;
			Шапка.Параметры.ВидНеисправности = Выборка.ВидДефекта;
			Шапка.Параметры.Влияние = Выборка.Влияние;
			ОписаниеПроблемы = Строка(Выборка.СимптомДефекта) + Символы.ПС + Выборка.ДефектОписание;
			Подвал1.Параметры.ОписаниеПроблемы = ОписаниеПроблемы;
			Шапка.Параметры.ОписаниеПроблемы = ОписаниеПроблемы;
			Шапка.Параметры.Завод = Выборка.Завод;
			Шапка.Параметры.Участок = Выборка.Участок;
			Если Не Выборка.ДатаНачала = null Тогда 
				Шапка.Параметры.ДатаНачала = Выборка.ДатаНачала + (СдвигЧП * 3600);
			КонецЕсли;
			Если Не Выборка.ДатаОкончания = null Тогда 
				Шапка.Параметры.ДатаОкончания = Выборка.ДатаОкончания + (СдвигЧП * 3600);
			КонецЕсли;
			Подвал.Параметры.Проверяющий = Выборка.Проверяющий;
		КонецЕсли;		
		//
		
		//
		СтрокаРР = "";
		Если ВыборкаРР1.НайтиСледующий(Новый Структура("Ссылка",Выборка1.Ссылка)) Тогда 
			ВыборкаРР = ВыборкаРР1.Выбрать();
			Пока ВыборкаРР.Следующий() Цикл
				СтрокаРР = СтрокаРР + ?(ЗначениеЗаполнено(СтрокаРР),Символы.ПС,"") + ВыборкаРР.РР;
			КонецЦикла;
		КонецЕсли;
		ВыборкаРР1.Сбросить();
		Шапка.Параметры.РР = СтрокаРР;
		//
		ТабДок.Вывести(Шапка);
		НомерПоследнейСтроки = НомерПоследнейСтроки + 16;
		НомерПП = 0;
		СтрокаНачала = НомерПоследнейСтроки - 6;
		//
		НомерПП = 0;
		Если ВыборкаМЗ1.НайтиСледующий(Новый Структура("Ссылка",Выборка1.Ссылка)) Тогда 
			ВыборкаМЗ = ВыборкаМЗ1.Выбрать();
			Пока ВыборкаМЗ.Следующий() Цикл
				НомерПП = НомерПП + 1;
				СтрокаМЗ.Параметры.НомерПП = НомерПП;
				СтрокаМЗ.Параметры.Номенклатура = ВыборкаМЗ.Номенклатура;
				ТабДок.Вывести(СтрокаМЗ);
				НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		ВыборкаМЗ1.Сбросить();
		СтрокаКонца = НомерПоследнейСтроки - 1;
		ТабДок.Область(СтрокаНачала,11,СтрокаКонца,11).Объединить();
		//ТабДок.Область(СтрокаНачала+4,9,СтрокаКонца,9).Объединить();
		//
		СтрокаНачала = НомерПоследнейСтроки;
		МероприятияПП = "";
		ТабДок.Вывести(Шапка1);
		НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
		НомерПП = 0;
		Если ВыборкаМ1.НайтиСледующий(Новый Структура("Ссылка",Выборка1.Ссылка)) Тогда 
			ВыборкаМ = ВыборкаМ1.Выбрать();
			Пока ВыборкаМ.Следующий() Цикл
				МероприятияПП = МероприятияПП + ?(ЗначениеЗаполнено(МероприятияПП),Символы.ПС,"") + ВыборкаМ.Мероприятие;
				НомерПП = НомерПП + 1;
				ЗаполнитьЗначенияСвойств(СтрокаМ.Параметры,ВыборкаМ);
				СтрокаМ.Параметры.НомерПП = НомерПП;
				СтрокаМ.Параметры.Срок = Формат(ВыборкаМ.Срок,"ДФ=дд.ММ.гггг");
				ТабДок.Вывести(СтрокаМ);
				НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		ВыборкаМ1.Сбросить();
		Подвал1.Параметры.МероприятияПП = МероприятияПП;
		СтрокаКонца = НомерПоследнейСтроки;
		//
		АнализКорневойПричины = "";
		Если ВыборкаА1.НайтиСледующий(Новый Структура("Ссылка",Выборка1.Ссылка)) Тогда 
			ВыборкаА = ВыборкаА1.Выбрать();
			Пока ВыборкаА.Следующий() Цикл
				АнализКорневойПричины = АнализКорневойПричины + ?(ЗначениеЗаполнено(АнализКорневойПричины),Символы.ПС,"") + ВыборкаА.Причина;
			КонецЦикла;
		КонецЕсли;
		ВыборкаА1.Сбросить();
		Подвал1.Параметры.АнализКорневойПричины = АнализКорневойПричины;
		//
		ТабДок.Вывести(Подвал);
		НомерПоследнейСтроки = НомерПоследнейСтроки + 4;
		//
		ТабДок.Область(СтрокаНачала,11,СтрокаКонца+2,11).Объединить();
		//ТабДок.Область(СтрокаНачала,9,СтрокаКонца+2,9).Объединить();
		
		ТабДок.Вывести(Подвал1);
		НомерПоследнейСтроки = НомерПоследнейСтроки + 6;
	КонецЦикла;
	//
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
КонецФункции

Функция Печать5Почему(МассивОбъектов, ПараметрыПечати) 
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.гкс_ЕВОБланк.ПФ_MXL_5Почему");
	ТабДок = Новый ТабличныйДокумент();
	//	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ЕВОБланк.Ссылка КАК Ссылка,
		|	гкс_ЕВОБланк.КорневаяПричинаТекст КАК КорневаяПричинаТекст
		|ПОМЕСТИТЬ ВсеЕВО
		|ИЗ
		|	Документ.гкс_ЕВОБланк КАК гкс_ЕВОБланк
		|ГДЕ
		|	гкс_ЕВОБланк.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеЕВО.Ссылка КАК Ссылка,
		|	ВсеЕВО.КорневаяПричинаТекст КАК КорневаяПричинаТекст,
		|	ДокТЧ.Причина КАК Причина,
		|	ДокТЧ.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВсеЕВО КАК ВсеЕВО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЕВОБланк.АнализПричины КАК ДокТЧ
		|		ПО ВсеЕВО.Ссылка = ДокТЧ.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|ИТОГИ ПО
		|	Ссылка";	
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	

	ЭтоПервый = Истина;
	Пока ВыборкаДок.Следующий() Цикл
		Если ЭтоПервый Тогда 
			ЭтоПервый = Ложь;
		Иначе
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		Шапка = Макет.ПолучитьОбласть("ШапкаОтдельно");
		ТабДок.Вывести(Шапка);
		ДокОб = ВыборкаДок.Ссылка.ПолучитьОбъект();
		//Линия1 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
		НомерПП = 2;
		СтрокиКорня = ПолучитьДеревоПричин(0, 0, ДокОб.АнализПричины);	
		ПостроитьТаблицуПричин(ТабДок, СтрокиКорня, 2, 2);
		
		
	КонецЦикла;
	//
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
КонецФункции

Функция ПечатьБланк2023(МассивОбъектов, ПараметрыПечати) 
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.гкс_ЕВОБланк.ПФ_MXL_ЕВОБланк2023");
	ТабДок = Новый ТабличныйДокумент();
	
	Шапка1 = Макет.ПолучитьОбласть("Шапка1");
	СтрокаМЗ = Макет.ПолучитьОбласть("СтрокаМЗ");
	СтрокаМ = Макет.ПолучитьОбласть("СтрокаМ");
	Легенда0 = Макет.ПолучитьОбласть("Легенда0");
	ШаблонКартинок = Макет.ПолучитьОбласть("ШаблонКартинок");
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	
	//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	НомерПоследнейСтроки = 1;
	//	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ЕВОБланк.Ссылка КАК Ссылка,
		|	гкс_ЕВОБланк.Организация КАК Организация,
		|	гкс_ЕВОБланк.Подразделение КАК Подразделение,
		|	гкс_ЕВОБланк.Номер КАК Номер,
		|	гкс_ЕВОБланк.Ответственный КАК ОтветственныйЕВО,
		|	гкс_ЕВОБланк.МерыПринятые КАК МерыПринятые,
		|	гкс_ЕВОБланк.КорневаяПричина КАК КорневаяПричина,
		|	гкс_ЕВОБланк.ВремяНачалаОстановки КАК ВремяНачалаОстановки,
		|	гкс_ЕВОБланк.ВремяВызоваТС КАК ВремяВызоваТС,
		|	гкс_ЕВОБланк.ВремяНачалаТС КАК ВремяНачалаТС,
		|	гкс_ЕВОБланк.ВремяОкончанияТС КАК ВремяОкончанияТС,
		|	гкс_ЕВОБланк.ВремяЗапуска КАК ВремяЗапуска,
		|	гкс_ЕВОБланк.ВидНеисправности КАК ВидНеисправности,
		// Гкс+[TOIR20-534] Зозуля А.В. от 21.02.2025. Добавлено:{
		|	гкс_ЕВОБланк.ТипПроблемы КАК ТипПроблемы,
		|	гкс_ЕВОБланк.ЗонаОтветственности КАК ЗонаОтветственности,
		// } Гкс-[TOIR20-534] Зозуля А.В. от 21.02.2025.
		|	гкс_ЕВОБланк.ТипКорневойПричины КАК ТипКорневойПричины,
		|	торо_ВыявленныеДефектыСписокДефектов.гкс_СимптомДефекта КАК СимптомДефекта,
		|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта КАК ОР,
		|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент КАК Отказавший,
		|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта КАК ВидДефекта,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.гкс_Влияние КАК Влияние,
		|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание КАК ДефектОписание,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.КонтактноеЛицоИнициатора КАК КЛИ,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения КАК ДатаОбнаружения,
		|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Ответственный КАК ОтветственныйВД,
		|	торо_ВыявленныеДефектыСписокДефектов.ID КАК ИД,
		|	гкс_ЕВОБланк.УровеньОстанова КАК УровеньОстанова
		|ПОМЕСТИТЬ ВсеЕВО
		|ИЗ
		|	Документ.гкс_ЕВОБланк КАК гкс_ЕВОБланк
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		|		ПО гкс_ЕВОБланк.ДокументОснование = торо_ВыявленныеДефектыСписокДефектов.Ссылка
		|ГДЕ
		|	гкс_ЕВОБланк.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеЕВО.Ссылка КАК Ссылка,
		|	МИНИМУМ(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ДатаОкончания) КАК ДатаОкончания,
		|	МАКСИМУМ(торо_ИсторияСтатусовСогласованияДокументов.Пользователь) КАК Проверяющий
		|ПОМЕСТИТЬ ИзАкта
		|ИЗ
		|	ВсеЕВО КАК ВсеЕВО
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		|		ПО ВсеЕВО.ИД = торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID
		|			И (торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов КАК торо_ИсторияСтатусовСогласованияДокументов
		|		ПО ВсеЕВО.Ссылка = торо_ИсторияСтатусовСогласованияДокументов.СогласуемыйДокумент
		|			И (торо_ИсторияСтатусовСогласованияДокументов.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.торо_СтатусыСогласованияДокументовРемонтныхРабот.Согласован))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеЕВО.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ВсеЕВО.Ссылка КАК Ссылка,
		|	ВсеЕВО.Организация КАК Организация,
		|	ВсеЕВО.Подразделение КАК Подразделение,
		|	ВсеЕВО.Номер КАК Номер,
		|	ВсеЕВО.ОтветственныйЕВО КАК ОтветственныйЕВО,
		|	ВсеЕВО.ВремяНачалаОстановки КАК ВремяНачалаОстановки,
		|	ВсеЕВО.ВремяВызоваТС КАК ВремяВызоваТС,
		|	ВсеЕВО.ВремяНачалаТС КАК ВремяНачалаТС,
		|	ВсеЕВО.ВремяОкончанияТС КАК ВремяОкончанияТС,
		|	ВсеЕВО.МерыПринятые КАК МерыПринятые,
		|	ВсеЕВО.ВремяЗапуска КАК ВремяЗапуска,
		|	ВсеЕВО.ТипКорневойПричины КАК ТипКорневойПричины,
		|	ВсеЕВО.СимптомДефекта КАК СимптомДефекта,
		|	ВсеЕВО.ОР КАК ОР,
		|	ВсеЕВО.Отказавший КАК Отказавший,
		|	ВсеЕВО.ВидДефекта КАК ВидДефекта,
		|	ВсеЕВО.Влияние КАК Влияние,
		|	ВсеЕВО.ДефектОписание КАК ДефектОписание,
		|	ВсеЕВО.КЛИ КАК КЛИ,
		|	ВсеЕВО.ДатаОбнаружения КАК ДатаОбнаружения,
		|	ВсеЕВО.ОтветственныйВД КАК ОтветственныйВД,
		|	ВсеЕВО.ИД КАК ИД,
		|	ВсеЕВО.ВидНеисправности КАК ВидНеисправности,
		// Гкс+[TOIR20-534] Зозуля А.В. от 21.02.2025. Добавлено:{
		|	ВсеЕВО.ТипПроблемы КАК ТипПроблемы,
		|	ВсеЕВО.ЗонаОтветственности КАК ЗонаОтветственности,
		// } Гкс-[TOIR20-534] Зозуля А.В. от 21.02.2025.
		|	ВсеЕВО.УровеньОстанова КАК УровеньОстанова,
		|	ИзАкта.ДатаНачала КАК ДатаНачала,
		|	ИзАкта.ДатаОкончания КАК ДатаОкончания,
		|	ИзАкта.Проверяющий КАК Проверяющий,
		|	гкс_ТехническиеМеста.ЗаводПодразделение КАК Завод,
		|	гкс_ТехническиеМеста.Участок КАК Участок
		|Поместить ВТ_ЕВОИтог
		|ИЗ
		|	ВсеЕВО КАК ВсеЕВО
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИзАкта КАК ИзАкта
		|		ПО ВсеЕВО.Ссылка = ИзАкта.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты.СписокДефектов КАК ДефектРемонты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК ЗаявкаРемонты
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТехническиеМеста КАК гкс_ТехническиеМеста
		|					ПО (гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
		|								И гкс_ТекущиеФМОР.ТМ = гкс_ТехническиеМеста.Ссылка
		|							ИЛИ НЕ гкс_ТекущиеФМОР.ОР = гкс_ТекущиеФМОР.ФМ
		|								И гкс_ТекущиеФМОР.ТМФМ = гкс_ТехническиеМеста.Ссылка)
		|				ПО ЗаявкаРемонты.ОбъектРемонта = гкс_ТекущиеФМОР.ОР
		|			ПО ДефектРемонты.ID = ЗаявкаРемонты.ID
		|		ПО ВсеЕВО.Ссылка.ДокументОснование = ДефектРемонты.Ссылка
		|;
		|ВЫБРАТЬ
		|	ТЧ.Ссылка КАК Ссылка,
		|	ТЧ.Номер КАК Номер,
		|	ТЧ.ОтветственныйЕВО КАК ОтветственныйЕВО,
		|	ТЧ.Ссылка.КорневаяПричинаТекст КАК КорневаяПричина,
		|	ТЧ.Ссылка.ДиаграммаСобытий КАК ДиаграммаСобытий,
		|	ТЧ.ВремяНачалаОстановки КАК ВремяНачалаОстановки,
		|	ТЧ.ВремяВызоваТС КАК ВремяВызоваТС,
		|	ТЧ.ВремяНачалаТС КАК ВремяНачалаТС,
		|	ТЧ.ВремяОкончанияТС КАК ВремяОкончанияТС,
		|	ТЧ.ВремяЗапуска КАК ВремяЗапуска,
		|	ТЧ.ТипКорневойПричины КАК ТипКорневойПричины,
		|	ТЧ.МерыПринятые КАК МерыПринятые,
		|	ТЧ.СимптомДефекта КАК СимптомДефекта,
		|	ТЧ.ОР КАК ОР,
		|	ТЧ.Отказавший КАК Отказавший,
		|	ТЧ.ВидДефекта КАК ВидДефекта,
		|	ТЧ.Влияние КАК Влияние,
		|	ТЧ.ДефектОписание КАК ДефектОписание,
		|	ТЧ.КЛИ КАК КЛИ,
		|	ТЧ.ДатаОбнаружения КАК ДатаОбнаружения,
		|	ТЧ.ОтветственныйВД КАК ОтветственныйВД,
		|	ТЧ.ИД КАК ИД,
		|	ТЧ.ВидНеисправности КАК ВидНеисправности,
		// Гкс+[TOIR20-534] Зозуля А.В. от 21.02.2025. Добавлено:{
		|	ТЧ.ТипПроблемы КАК ТипПроблемы,
		|	ТЧ.ЗонаОтветственности КАК ЗонаОтветственности,
		// } Гкс-[TOIR20-534] Зозуля А.В. от 21.02.2025.
		|	ТЧ.ДатаНачала КАК ДатаНачала,
		|	ТЧ.ДатаОкончания КАК ДатаОкончания,
		|	ТЧ.Проверяющий КАК Проверяющий,
		|	ТЧ.Организация КАК Организация,
		|	ТЧ.Подразделение КАК Подразделение,
		|	ТЧ.Завод КАК Завод,
		|	ТЧ.Участок КАК Участок,
		|	ТЧ.УровеньОстанова КАК УровеньОстанова
		|ИЗ
		|	ВТ_ЕВОИтог КАК ТЧ
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Мероприятие КАК Мероприятие,
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Ответственный КАК Ответственный,
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Срок КАК Срок,
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.гкс_ЕВОБланк.МероприятияПоПредупреждению КАК гкс_ЕВОБланкМероприятияПоПредупреждению
		|ГДЕ
		|	гкс_ЕВОБланкМероприятияПоПредупреждению.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	гкс_ЕВОБланкАнализПричины.Причина КАК Причина,
		|	гкс_ЕВОБланкАнализПричины.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.гкс_ЕВОБланк.АнализПричины КАК гкс_ЕВОБланкАнализПричины
		|ГДЕ
		|	гкс_ЕВОБланкАнализПричины.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.ID КАК ИД,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Родитель_ID КАК Родитель_ИД,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота КАК РемонтнаяРабота,
		|	НужныеДефекты.ИД КАК ИДРемонта,
		|	торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка КАК Акт,
		|	ТИПЗНАЧЕНИЯ(торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтнаяРабота) = ТИП(Справочник.торо_ИдентификаторыТехКарт) КАК ЭтоТК,
		|	НужныеДефекты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВсеРРИзАкта
		|ИЗ
		|	ВсеЕВО КАК НужныеДефекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.РемонтныеРаботы КАК торо_АктОВыполненииЭтапаРаботРемонтныеРаботы
		|		ПО НужныеДефекты.ИД = торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.РемонтыОборудования_ID
		|			И (торо_АктОВыполненииЭтапаРаботРемонтныеРаботы.Ссылка.ПометкаУдаления = ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеРРИзАкта.ИДРемонта КАК ИДРемонта,
		|	ВсеРРИзАкта.ИД КАК ИД,
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура КАК Номенклатура,
		|	ВсеРРИзАкта.Акт КАК Акт,
		|	ВсеРРИзАкта.Родитель_ИД КАК Родитель_ИД
		|ПОМЕСТИТЬ ВсеМЗИзАкта
		|ИЗ
		|	ВсеРРИзАкта КАК ВсеРРИзАкта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_АктОВыполненииЭтапаРабот.МатериальныеЗатраты КАК торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты
		|		ПО ВсеРРИзАкта.Акт = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Ссылка
		|			И ВсеРРИзАкта.ИДРемонта = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.РемонтыОборудования_ID
		|			И ВсеРРИзАкта.ИД = торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ID
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеРРИзАкта.ИДРемонта,
		|	ВсеРРИзАкта.ИД,
		|	ВсеРРИзАкта.Акт,
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.ЕдиницаИзмерения,
		|	торо_АктОВыполненииЭтапаРаботМатериальныеЗатраты.Номенклатура,
		|	ВсеРРИзАкта.Родитель_ИД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеМЗИзАкта.Номенклатура КАК Номенклатура,
		|	ВсеРРИзАкта.Ссылка КАК Ссылка
		|ИЗ
		|	ВсеРРИзАкта КАК ВсеРРИзАкта
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеМЗИзАкта КАК ВсеМЗИзАкта
		|		ПО ВсеРРИзАкта.ИД = ВсеМЗИзАкта.Родитель_ИД
		|			И ВсеРРИзАкта.Акт = ВсеМЗИзАкта.Акт
		|ГДЕ
		|	ВсеРРИзАкта.ЭтоТК = ИСТИНА
		|ИТОГИ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеРРИзАкта.Ссылка КАК Ссылка,
		|	ВсеРРИзАкта.РемонтнаяРабота КАК РР
		|ИЗ
		|	ВсеРРИзАкта КАК ВсеРРИзАкта
		//|ГДЕ
		//|	ВсеРРИзАкта.ЭтоТК = ИСТИНА
		|ИТОГИ ПО
		|	Ссылка";	
		Запрос.Текст = Запрос.Текст + " ; "
		+ "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Рег.Пользователь КАК Пользователь,
		|	Рег.СтатусДокумента КАК Статус,
		|	Рег.Период КАК Период,
		|	Рег.СогласуемыйДокумент КАК Док
		|ПОМЕСТИТЬ ТЧ_ИсторияСогласования
		|ИЗ
		|	РегистрСведений.торо_ИсторияСтатусовСогласованияДокументов КАК Рег
		|Где Рег.СогласуемыйДокумент В (&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Рег.ТекущаяДолжность КАК Должность,
		|	ТЧ.Пользователь КАК Пользователь,
		|	ТЧ.Статус.Код КАК Статус,
		|	ТЧ.Период КАК Период,
		|	ТЧ.Док КАК Док,
		|	ТЧ.Пользователь.ФизическоеЛицо КАК ФИО
		|ИЗ
		|	ТЧ_ИсторияСогласования КАК ТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК Рег
		|		ПО ТЧ.Пользователь.ФизическоеЛицо = Рег.ФизическоеЛицо
		// гкс+ [] Деснол 16.09.2022
		|УПОРЯДОЧИТЬ ПО
		|	Период
		// гкс- [] Деснол 16.09.2022
		|ИТОГИ ПО
		|	Док";
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);	
	РезультатЗапроса = Запрос.ВыполнитьПакет();	
	Выборка1 = РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаМ1 = РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаА1 = РезультатЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаМЗ1 = РезультатЗапроса[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	ВыборкаРР1 = РезультатЗапроса[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	ВыборкаСогласования = РезультатЗапроса[11].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	

	Пока Выборка1.Следующий() Цикл
		Шапка = Макет.ПолучитьОбласть("Шапка"); // Для очистки полей
		Подвал = Макет.ПолучитьОбласть("Подвал");
		Подвал1 = Макет.ПолучитьОбласть("Подвал1");
		//
		НачПодр = "________________";
		ВыборкаСогласования.Сбросить();
		Если ВыборкаСогласования.НайтиСледующий(Новый Структура("Док", Выборка1.Ссылка)) Тогда 
			ВыборкаИС = ВыборкаСогласования.Выбрать();
			Пока ВыборкаИС.Следующий() Цикл
				Если ВыборкаИС.Статус = "П00000035" Тогда 
					НачПодр = ПреобразоватьФИО(ВыборкаИС.ФИО);;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//
		Если НомерПоследнейСтроки > 1 Тогда 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		Выборка = Выборка1.Выбрать();
		Если Выборка.Следующий() Тогда 
			Подвал.Параметры.ОтветственныйЕВО = Выборка.ОтветственныйЕВО;
			Подвал1.Параметры.КорневаяПричина = Выборка.КорневаяПричина;
			Подвал1.Параметры.ДиаграммаСобытий = Выборка.ДиаграммаСобытий;
			// гкс+ [10.23] Деснол 09.04.2024
			Подвал1.Параметры.НачПодр = НачПодр;
			// гкс- [10.23] Деснол 09.04.2024
			Шапка.Параметры.Номер = Выборка.Номер;
			Если ЗначениеЗаполнено(Выборка.ВремяВызоваТС) Тогда 
				Шапка.Параметры.ВремяВызоваТС = Выборка.ВремяВызоваТС + (СдвигЧП * 3600);
			Иначе
				Шапка.Параметры.ВремяВызоваТС = "";
			КонецЕсли;
			Шапка.Параметры.ВремяНачалаОстановки = Выборка.ВремяНачалаОстановки + (СдвигЧП * 3600);
			Шапка.Параметры.ВремяЗапуска = Выборка.ВремяЗапуска + (СдвигЧП * 3600);
			//Шапка.Параметры.ТипКорневойПричины = Выборка.ТипКорневойПричины;
			//
			Шапка.Параметры.ДатаОбнаружения = Выборка.ДатаОбнаружения + (СдвигЧП * 3600);
			Шапка.Параметры.КЛИ = Выборка.КЛИ;
			Шапка.Параметры.ОР = Выборка.ОР;
			Шапка.Параметры.Отказавший = Выборка.Отказавший;
			Шапка.Параметры.Ответственный = Выборка.ОтветственныйВД;
			Подвал.Параметры.Ответственный = Выборка.ОтветственныйВД;
			//Шапка.Параметры.ВидНеисправности = Выборка.ВидДефекта;
			//Шапка.Параметры.Влияние = Выборка.Влияние;
			ОписаниеПроблемы = Строка(Выборка.СимптомДефекта) + Символы.ПС + Выборка.ДефектОписание;
			Подвал1.Параметры.ОписаниеПроблемы = ОписаниеПроблемы;
			Шапка.Параметры.ОписаниеПроблемы = ОписаниеПроблемы;
			Если ЗначениеЗаполнено(Выборка.Завод) Тогда 
				Шапка.Параметры.Завод = Выборка.Завод;
				Шапка.Параметры.Участок = Выборка.Участок;
			Иначе
				Шапка.Параметры.Завод = Выборка.Организация;
				Шапка.Параметры.Участок = Выборка.Подразделение;
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ВремяНачалаТС) Тогда 
				Шапка.Параметры.ДатаНачала = Выборка.ВремяНачалаТС + (СдвигЧП * 3600);
			ИначеЕсли Не Выборка.ДатаНачала = null Тогда 
				Шапка.Параметры.ДатаНачала = Выборка.ДатаНачала + (СдвигЧП * 3600);
			Иначе
				Шапка.Параметры.ДатаНачала = "";
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ВремяОкончанияТС) Тогда 
				Шапка.Параметры.ДатаОкончания = Выборка.ВремяОкончанияТС + (СдвигЧП * 3600);
			ИначеЕсли Не Выборка.ДатаОкончания = null Тогда 
				Шапка.Параметры.ДатаОкончания = Выборка.ДатаОкончания + (СдвигЧП * 3600);
			Иначе
				Шапка.Параметры.ДатаОкончания = "";
			КонецЕсли;
			Подвал.Параметры.Проверяющий = Выборка.Проверяющий;
			Шапка.Параметры.РР = Выборка.МерыПринятые;
			// Гкс+[TOIR20-534] Зозуля А.В. от 21.02.2025. Изменено:{
			////
			//Если Выборка.ВидНеисправности = "Механическая" Тогда 
			//	Шапка.Область(9, 2, 9, 2).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли Выборка.ВидНеисправности = "Электрическая" Тогда 
			//	Шапка.Область(9, 3, 9, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли Выборка.ВидНеисправности = "Производственный персонал" Тогда 
			//	Шапка.Область(9, 5, 9, 5).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли Выборка.ВидНеисправности = "КИПиА" Тогда 
			//	Шапка.Область(9, 4, 9, 4).Картинка = ШаблонКартинок.Область(1, 3, 1, 3).Картинка;
			//ИначеЕсли Выборка.ВидНеисправности = "АСУП" Тогда 
			//	Шапка.Область(9, 4, 9, 4).Картинка = ШаблонКартинок.Область(1, 4, 1, 4).Картинка;
			//ИначеЕсли Выборка.ВидНеисправности = "Метрология" Тогда 
			//	Шапка.Область(9, 4, 9, 4).Картинка = ШаблонКартинок.Область(1, 5, 1, 5).Картинка;
			//КонецЕсли;

			//// гкс+ [10.23] Деснол 22.03.2024
			//Если Выборка.УровеньОстанова = 1 Тогда 
			//	Шапка.Область(14, 3, 14, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли Выборка.УровеньОстанова = 2 Тогда 
			//	Шапка.Область(15, 3, 15, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли Выборка.УровеньОстанова = 3 Тогда 
			//	Шапка.Область(16, 3, 16, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//КонецЕсли;
			//ТекстИмя = Строка(Выборка.ТипКорневойПричины);
			//Если СтрНайти(ТекстИмя, "Человеческий фактор") > 0 Тогда 
			//	Шапка.Область(18, 3, 18, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли СтрНайти(ТекстИмя, "Проектные ошибки") > 0 Тогда 
			//	Шапка.Область(19, 3, 19, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли СтрНайти(ТекстИмя, "Отказы, остановы") > 0 Тогда 
			//	Шапка.Область(20, 3, 20, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли СтрНайти(ТекстИмя, "Технологический фактор") > 0 Тогда 
			//	Шапка.Область(21, 3, 21, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли СтрНайти(ТекстИмя, "Обеспечение энергоресурсами") > 0 Тогда 
			//	Шапка.Область(22, 3, 22, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли СтрНайти(ТекстИмя, "Сырьевое обеспечение") > 0 Тогда 
			//	Шапка.Область(23, 3, 23, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли СтрНайти(ТекстИмя, "Недостатки документации") > 0 Тогда 
			//	Шапка.Область(24, 3, 24, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//ИначеЕсли СтрНайти(ТекстИмя, "Закуп и хранение") > 0 Тогда 
			//	Шапка.Область(25, 3, 25, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			//КонецЕсли;
			//// гкс- [10.23] Деснол 22.03.2024
			
			Если Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.ПроблемаСКачеством Тогда 
				Шапка.Область(9, 2, 9, 2).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.БлокировкаПродуктом Тогда 
				Шапка.Область(9, 2, 9, 2).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;
			ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.ПопаданиеПостороннегоПредмета Тогда 
				Шапка.Область(9, 3, 9, 3).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.Механика Тогда 
				Шапка.Область(9, 3, 9, 3).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;
			ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.АСУТП Тогда 
				Шапка.Область(9, 4, 9, 4).Картинка = ШаблонКартинок.Область(1, 3, 1, 3).Картинка;
			ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.КИПиА Тогда 
				Шапка.Область(9, 4, 9, 4).Картинка = ШаблонКартинок.Область(1, 4, 1, 4).Картинка;				
			ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.Электрика Тогда 
				Шапка.Область(9, 4, 9, 4).Картинка = ШаблонКартинок.Область(1, 5, 1, 5).Картинка;
			ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.Метрология Тогда 
				Шапка.Область(9, 5, 9, 5).Картинка = ШаблонКартинок.Область(1, 3, 1, 3).Картинка;
			ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.Внешняя Тогда 
				Шапка.Область(9, 5, 9, 5).Картинка = ШаблонКартинок.Область(1, 4, 1, 4).Картинка;
	        ИначеЕсли Выборка.ТипПроблемы = Перечисления.гкс_ТипыПроблем.НеОпределена Тогда 
				Шапка.Область(9, 5, 9, 5).Картинка = ШаблонКартинок.Область(1, 5, 1, 5).Картинка;
			КонецЕсли;
			
			Если Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.ОтделПланированияТОиР Тогда 
				Шапка.Область(12, 2, 12, 2).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.Механики Тогда 
				Шапка.Область(12, 2, 12, 2).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.АСУТП Тогда 
				Шапка.Область(12, 3, 12, 3).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.ИСЗиС Тогда 
				Шапка.Область(12, 3, 12, 3).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.КИПиА Тогда 
				Шапка.Область(12, 4, 12, 4).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.Метрология Тогда 
				Шапка.Область(12, 4, 12, 4).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;				
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.ПСиГХ Тогда 
				Шапка.Область(12, 5, 12, 5).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.ВОиК Тогда 
				Шапка.Область(12, 5, 12, 5).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.ВКиАО Тогда 
				Шапка.Область(12, 6, 12, 6).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.Электрики Тогда 
				Шапка.Область(12, 6, 12, 6).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.РМУ_ЦКОО Тогда 
				Шапка.Область(12, 7, 12, 7).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;	                                                                             
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.Производство Тогда 
				Шапка.Область(12, 8, 12, 8).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.Технология Тогда 
				Шапка.Область(12, 9, 12, 9).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.СЗМОиУ Тогда 
				Шапка.Область(12, 9, 12, 9).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.СервиснаяКомпания Тогда 
				Шапка.Область(12, 10, 12, 10).Картинка = ШаблонКартинок.Область(1, 6, 1, 6).Картинка;
			ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.Внешняя Тогда 
				Шапка.Область(12, 10, 12, 10).Картинка = ШаблонКартинок.Область(1, 7, 1, 7).Картинка;	
            ИначеЕсли Выборка.ЗонаОтветственности = Перечисления.гкс_ЗоныОтветственности.НеОпределена Тогда 
				Шапка.Область(12, 11, 12, 11).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;	
			КонецЕсли;
			
			Если Выборка.УровеньОстанова = 1 Тогда 
				Шапка.Область(17, 3, 17, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли Выборка.УровеньОстанова = 2 Тогда 
				Шапка.Область(18, 3, 18, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли Выборка.УровеньОстанова = 3 Тогда 
				Шапка.Область(19, 3, 19, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			КонецЕсли;
			
			ТекстИмя = Строка(Выборка.ТипКорневойПричины);
			Если СтрНайти(ТекстИмя, "Человеческий фактор") > 0 Тогда 
				Шапка.Область(21, 3, 21, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли СтрНайти(ТекстИмя, "Проектные ошибки") > 0 Тогда 
				Шапка.Область(22, 3, 22, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли СтрНайти(ТекстИмя, "Отказы, остановы") > 0 Тогда 
				Шапка.Область(23, 3, 23, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли СтрНайти(ТекстИмя, "Технологический фактор") > 0 Тогда 
				Шапка.Область(24, 3, 24, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли СтрНайти(ТекстИмя, "Обеспечение энергоресурсами") > 0 Тогда 
				Шапка.Область(25, 3, 25, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли СтрНайти(ТекстИмя, "Сырьевое обеспечение") > 0 Тогда 
				Шапка.Область(26, 3, 26, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли СтрНайти(ТекстИмя, "Недостатки документации") > 0 Тогда 
				Шапка.Область(27, 3, 27, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			ИначеЕсли СтрНайти(ТекстИмя, "Закуп и хранение") > 0 Тогда 
				Шапка.Область(28, 3, 28, 3).Картинка = ШаблонКартинок.Область(1, 2, 1, 2).Картинка;
			КонецЕсли;
			// } Гкс-[TOIR20-534] Зозуля А.В. от 21.02.2025.

		КонецЕсли;		
		//
		
		//
		//СтрокаРР = "";
		//Если ВыборкаРР1.НайтиСледующий(Новый Структура("Ссылка",Выборка1.Ссылка)) Тогда 
		//	ВыборкаРР = ВыборкаРР1.Выбрать();
		//	Пока ВыборкаРР.Следующий() Цикл
		//		СтрокаРР = СтрокаРР + ?(ЗначениеЗаполнено(СтрокаРР),Символы.ПС,"") + ВыборкаРР.РР;
		//	КонецЦикла;
		//КонецЕсли;
		//ВыборкаРР1.Сбросить();
		//Шапка.Параметры.РР = СтрокаРР;
		//
		ТабДок.Вывести(Шапка);
		// Гкс+[TOIR20-534] Зозуля А.В. от 21.02.2025. Изменено:{
		//НомерПоследнейСтроки = НомерПоследнейСтроки + 29;
		НомерПоследнейСтроки = НомерПоследнейСтроки + 32;
		// } Гкс-[TOIR20-534] Зозуля А.В. от 21.02.2025.
		НомерПП = 0;
		СтрокаНачала = НомерПоследнейСтроки - 17;
		СтрокаНачала2 = НомерПоследнейСтроки - 2;
		//
		НомерПП = 0;
		Если ВыборкаМЗ1.НайтиСледующий(Новый Структура("Ссылка",Выборка1.Ссылка)) Тогда 
			ВыборкаМЗ = ВыборкаМЗ1.Выбрать();
			Пока ВыборкаМЗ.Следующий() Цикл
				НомерПП = НомерПП + 1;
				СтрокаМЗ.Параметры.НомерПП = НомерПП;
				СтрокаМЗ.Параметры.Номенклатура = ВыборкаМЗ.Номенклатура;
				ТабДок.Вывести(СтрокаМЗ);
				НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		ВыборкаМЗ1.Сбросить();
		СтрокаКонца = НомерПоследнейСтроки - 1;
		ТабДок.Область(СтрокаНачала, 13, СтрокаКонца, 13).Объединить();
		ТабДок.Область(СтрокаНачала2, 12, СтрокаКонца, 12).Объединить();
		//
		СтрокаНачала = НомерПоследнейСтроки;
		МероприятияПП = "";
		ТабДок.Вывести(Шапка1);
		НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
		НомерПП = 0;
		Если ВыборкаМ1.НайтиСледующий(Новый Структура("Ссылка",Выборка1.Ссылка)) Тогда 
			ВыборкаМ = ВыборкаМ1.Выбрать();
			Пока ВыборкаМ.Следующий() Цикл
				МероприятияПП = МероприятияПП + ?(ЗначениеЗаполнено(МероприятияПП),Символы.ПС,"") + ВыборкаМ.Мероприятие;
				НомерПП = НомерПП + 1;
				ЗаполнитьЗначенияСвойств(СтрокаМ.Параметры,ВыборкаМ);
				СтрокаМ.Параметры.НомерПП = НомерПП;
				СтрокаМ.Параметры.Срок = Формат(ВыборкаМ.Срок,"ДФ=дд.ММ.гггг");
				ТабДок.Вывести(СтрокаМ);
				НомерПоследнейСтроки = НомерПоследнейСтроки + 1;
			КонецЦикла;
		КонецЕсли;
		ВыборкаМ1.Сбросить();
		//Шапка.Параметры.МероприятияПП = МероприятияПП;
		СтрокаКонца = НомерПоследнейСтроки;
		//
		АнализКорневойПричины = "";
		Если ВыборкаА1.НайтиСледующий(Новый Структура("Ссылка",Выборка1.Ссылка)) Тогда 
			ВыборкаА = ВыборкаА1.Выбрать();
			Пока ВыборкаА.Следующий() Цикл
				АнализКорневойПричины = АнализКорневойПричины + ?(ЗначениеЗаполнено(АнализКорневойПричины),Символы.ПС,"") + ВыборкаА.Причина;
			КонецЦикла;
		КонецЕсли;
		ВыборкаА1.Сбросить();
		Подвал1.Параметры.АнализКорневойПричины = АнализКорневойПричины;
		//
		ТабДок.Вывести(Подвал);
		НомерПоследнейСтроки = НомерПоследнейСтроки + 4;
		//
		ТабДок.Область(СтрокаНачала, 12, СтрокаКонца + 2, 12).Объединить();
		ТабДок.Область(СтрокаНачала, 13, СтрокаКонца + 2, 13).Объединить();
		
		ТабДок.Вывести(Легенда0);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДок.Вывести(Подвал1);
		НомерПоследнейСтроки = НомерПоследнейСтроки + 7;
	КонецЦикла;
	//
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
КонецФункции

// гкс+ [10.23] Деснол 09.04.2024

Функция ПреобразоватьФИО(Сотрудник)
	МассивИмени = СтрРазделить(Строка(Сотрудник)," ",Ложь);
	Если МассивИмени.Количество() > 2 Тогда 
		Возврат МассивИмени[0] +" "+ Лев(МассивИмени[1],1) +". "+ Лев(МассивИмени[2],1)+".";
	КонецЕсли;
	Возврат Сотрудник;
КонецФункции // гкс- [10.23] Деснол 09.04.2024

// гкс+ [10.23] Деснол 19.04.2024
Функция ПолучитьДеревоПричин(РодительИД, Уровень, АнализПричины)	
	МассивОтвета = Новый Массив();
	СтрокиКорня = АнализПричины.НайтиСтроки(Новый Структура("РодительИД", РодительИД));
	Для Каждого СТ Из СтрокиКорня Цикл
		ЭтиСтроки = ПолучитьДеревоПричин(СТ.ИД, Уровень + 1, АнализПричины);
		Если ЭтиСтроки.Количество() Тогда 
			Высота = 0;
			Для Каждого СМ ИЗ ЭтиСтроки Цикл
				Высота = СМ.Высота + Высота;
			КонецЦикла;
		Иначе
			Высота = 1;
		КонецЕсли;
		ТемпСтрукт = Новый Структура("Текст,ИД,ЭтиСтроки", СТ.Причина, СТ.ИД, ЭтиСтроки);
		ТемпСтрукт.Вставить("Высота", Высота);
		ТемпСтрукт.Вставить("Уровень", Уровень);
		ТемпСтрукт.Вставить("КорневаяПричина", СТ.КорневаяПричина);
		МассивОтвета.Добавить(ТемпСтрукт);
	КонецЦикла;
	Возврат МассивОтвета;
КонецФункции // гкс- [10.23] Деснол 19.04.2024

// гкс+ [10.23] Деснол 19.04.2024
Процедура ПостроитьТаблицуПричин(ТабДок, СтрокиКорня, НСтроки, НСтолбца)
	Линия1 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	Линия2 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 3);
	НомерПП = НСтроки;
	Для Каждого СТ Из СтрокиКорня Цикл
		//вывод текущей
		Блок2 = ТабДок.Область(НомерПП, НСтолбца, НомерПП + СТ.Высота - 1, НСтолбца);
		Блок2.Текст = СТ.Текст;
		Блок2.Имя = Формат(СТ.ИД, "ЧГ=");
		Блок2.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Блок2.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		Блок2.Объединить();
		Блок2.Обвести(Линия1, Линия1, Линия1, Линия1);
		Если НСтолбца > 2 Тогда 
			Блок1 = ТабДок.Область(НомерПП, НСтолбца - 1, НомерПП + СТ.Высота - 1, НСтолбца - 1);
			Блок1.Текст = Строка(СТ.Уровень) + " почему";
			Блок1.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			Блок1.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			Блок1.Объединить();
			Блок1.Обвести(Линия1, Линия1, Линия1, Линия1);
		КонецЕсли;
		// вывод подчиненных
		ПостроитьТаблицуПричин(ТабДок, СТ.ЭтиСтроки, НомерПП, НСтолбца + 2);
		Если НСтолбца < 3 Тогда 
			Для Сч = НСтолбца По 12 Цикл
				ТабДок.Область(НомерПП, Сч, НомерПП + СТ.Высота - 1, Сч).Обвести(Линия1, Линия1, Линия1, Линия1);
			КонецЦикла;
		КонецЕсли;
		НомерПП = НомерПП + СТ.Высота;
	КонецЦикла;
КонецПроцедуры // гкс- [10.23] Деснол 19.04.2024

#КонецОбласти
